# DATA FRAMES

## operations

1. column selection
2. column addition 
3. column deletion

You can treat a DataFrame semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same syntax as the analogous dict operations:

In [3]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    "one": {"I":1,"II":2,"III":3},
    "two": {"I":1.0,"II":2.0}
})
df

     one  two
I      1  1.0
II     2  2.0
III    3  NaN

# column addition

we can just use df["newColumnName"] = data/list etc..

In [8]:
df["flag"] = df["two"]>0
df

     one  two   flag
I      1  1.0   True
II     2  2.0   True
III    3  NaN  False

## column deletion

we can just use 
del df["newColumnName"] directly deletes the column
        or
df.pop("columnName") deletes and return deleted column

In [9]:
del df["flag"]
df

     one  two
I      1  1.0
II     2  2.0
III    3  NaN

In [13]:
df["flag"] = df["two"]>0
df1 = df.pop("flag")
df1

I       True
II      True
III    False
Name: flag, dtype: bool

## column insertion

there are multiple ways to insert so
1. df["newColumnName"] = someVal/listOfval => if theres only one val then it will be duplicated to match no.of rows in dataset
2. copying one column to other with new name
    df["newColumnName"] = df["copyColumnName"][ slicingstart : slicingend ]
    if no.of rows selected is less than total then new column will have NaN in remaining

In [17]:
df["foo"] = "boo"
df

     one  two  foo
I      1  1.0  boo
II     2  2.0  boo
III    3  NaN  boo

In [19]:
df["copyone"] = df["one"][:2]
df

     one  two  foo  copyone
I      1  1.0  boo      1.0
II     2  2.0  boo      2.0
III    3  NaN  boo      NaN

## assigning new column at the moment

assigning new column while analysing is very important so we can just use 
.assign(newColumnName=function("existingColumnName"))

In [22]:
df.assign(mean = df["one"].mean(),median=df["one"].median()).head()

     one  two  foo  copyone  mean  median
I      1  1.0  boo      1.0   2.0     2.0
II     2  2.0  boo      2.0   2.0     2.0
III    3  NaN  boo      NaN   2.0     2.0

## select column using its name

In [24]:
df["one"]

I      1
II     2
III    3
Name: one, dtype: int64

## select row by label name

In [25]:
df.loc["I"]

one          1
two        1.0
foo        boo
copyone    1.0
Name: I, dtype: object

## select row by integer location

In [26]:
df.iloc[2]

one          3
two        NaN
foo        boo
copyone    NaN
Name: III, dtype: object

## slice rows

In [28]:
df[0:2]

    one  two  foo  copyone
I     1  1.0  boo      1.0
II    2  2.0  boo      2.0

## select rows by boolean vectors

In [29]:
df[df["one"]>1]

     one  two  foo  copyone
II     2  2.0  boo      2.0
III    3  NaN  boo      NaN